Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX1025MTG64.atdf
    <module caption="Quad Serial Peripheral Interface" name="QSPI" id="44132" version="G">
      <register-group name="QSPI">
        <register caption="Control Register" name="QSPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="QSPI Enable" mask="0x00000001" name="QSPIEN"/>
          <bitfield caption="QSPI Disable" mask="0x00000002" name="QSPIDIS"/>
          <bitfield caption="QSPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Update Configuration" mask="0x00000100" name="UPDCFG"/>
          <bitfield caption="Start Transfer" mask="0x00000200" name="STTFR"/>
          <bitfield caption="Reset Time-out" mask="0x00000400" name="RTOUT"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="QSPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Serial Memory Mode" mask="0x00000001" name="SMM" values="QSPI_MR__SMM"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000004" name="WDRBT" values="QSPI_MR__WDRBT"/>
          <bitfield caption="Chip Select Mode" mask="0x00000030" name="CSMODE" values="QSPI_MR__CSMODE"/>
          <bitfield caption="Tamper Clear Enable" mask="0x00000080" name="TAMPCLR"/>
          <bitfield caption="Number Of Bits Per Transfer" mask="0x00000F00" name="NBBITS" values="QSPI_MR__NBBITS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0x00FF0000" name="DLYBCT"/>
          <bitfield caption="Minimum Inactive QCS Delay" mask="0xFF000000" name="DLYCS"/>
        </register>
        <register caption="Receive Data Register" name="QSPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
        </register>
        <register caption="Transmit Data Register" name="QSPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
        </register>
        <register caption="Interrupt Status Register" name="QSPI_ISR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading QSPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing QSPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing QSPI_TDR)" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of RX buffer" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of TX buffer" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="Chip Select Rise (cleared on read)" mask="0x00000100" name="CSR"/>
          <bitfield caption="Instruction End Status (cleared on read)" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="Last Write Access (cleared on read)" mask="0x00000800" name="LWRA"/>
          <bitfield caption="QSPI Interrupt Fall" mask="0x00001000" name="QITF"/>
          <bitfield caption="QSPI Interrupt Rise" mask="0x00002000" name="QITR"/>
          <bitfield caption="Chip Select Fall Autoclear" mask="0x00004000" name="CSFA"/>
          <bitfield caption="Chip Select Rise Autoclear" mask="0x00008000" name="CSRA"/>
          <bitfield caption="QSPI Time-out" mask="0x00020000" name="TOUT"/>
        </register>
        <register caption="Interrupt Enable Register" name="QSPI_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="Chip Select Rise Interrupt Enable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Instruction End Interrupt Enable" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="Last Write Access Interrupt Enable" mask="0x00000800" name="LWRA"/>
          <bitfield caption="QSPI Interrupt Fall Interrupt Enable" mask="0x00001000" name="QITF"/>
          <bitfield caption="QSPI Interrupt Rise Interrupt Enable" mask="0x00002000" name="QITR"/>
          <bitfield caption="Chip Select Fall Autoclear Interrupt Enable" mask="0x00004000" name="CSFA"/>
          <bitfield caption="Chip Select Rise Autoclear Interrupt Enable" mask="0x00008000" name="CSRA"/>
          <bitfield caption="QSPI Time-out Interrupt Enable" mask="0x00020000" name="TOUT"/>
        </register>
        <register caption="Interrupt Disable Register" name="QSPI_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="Chip Select Rise Interrupt Disable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Instruction End Interrupt Disable" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="Last Write Access Interrupt Disable" mask="0x00000800" name="LWRA"/>
          <bitfield caption="QSPI Interrupt Fall Interrupt Disable" mask="0x00001000" name="QITF"/>
          <bitfield caption="QSPI Interrupt Rise Interrupt Disable" mask="0x00002000" name="QITR"/>
          <bitfield caption="Chip Select Fall Autoclear Interrupt Disable" mask="0x00004000" name="CSFA"/>
          <bitfield caption="Chip Select Rise Autoclear Interrupt Disable" mask="0x00008000" name="CSRA"/>
          <bitfield caption="QSPI Time-out Interrupt Disable" mask="0x00020000" name="TOUT"/>
        </register>
