Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX1025MTG64.atdf
        <register caption="SEFC User Signature Rights Register" name="EEFC_USR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Read Enable for User Signature Block 0" mask="0x00000001" name="RDENUSB0"/>
          <bitfield caption="Read Enable for User Signature Block 1" mask="0x00000002" name="RDENUSB1"/>
          <bitfield caption="Read Enable for User Signature Block 2" mask="0x00000004" name="RDENUSB2"/>
          <bitfield caption="Read Enable for User Signature Block 3" mask="0x00000008" name="RDENUSB3"/>
          <bitfield caption="Read Enable for User Signature Block 4" mask="0x00000010" name="RDENUSB4"/>
          <bitfield caption="Read Enable for User Signature Block 5" mask="0x00000020" name="RDENUSB5"/>
          <bitfield caption="Read Enable for User Signature Block 6" mask="0x00000040" name="RDENUSB6"/>
          <bitfield caption="Read Enable for User Signature Block 7" mask="0x00000080" name="RDENUSB7"/>
          <bitfield caption="Write Enable for User Signature Block 0" mask="0x00000100" name="WRENUSB0"/>
          <bitfield caption="Write Enable for User Signature Block 1" mask="0x00000200" name="WRENUSB1"/>
          <bitfield caption="Write Enable for User Signature Block 2" mask="0x00000400" name="WRENUSB2"/>
          <bitfield caption="Write Enable for User Signature Block 3" mask="0x00000800" name="WRENUSB3"/>
          <bitfield caption="Write Enable for User Signature Block 4" mask="0x00001000" name="WRENUSB4"/>
          <bitfield caption="Write Enable for User Signature Block 5" mask="0x00002000" name="WRENUSB5"/>
          <bitfield caption="Write Enable for User Signature Block 6" mask="0x00004000" name="WRENUSB6"/>
          <bitfield caption="Write Enable for User Signature Block 7" mask="0x00008000" name="WRENUSB7"/>
          <bitfield caption="Privileged Access for User Signature Block 0" mask="0x00010000" name="PRIVUSB0"/>
          <bitfield caption="Privileged Access for User Signature Block 1" mask="0x00020000" name="PRIVUSB1"/>
          <bitfield caption="Privileged Access for User Signature Block 2" mask="0x00040000" name="PRIVUSB2"/>
          <bitfield caption="Privileged Access for User Signature Block 3" mask="0x00080000" name="PRIVUSB3"/>
          <bitfield caption="Privileged Access for User Signature Block 4" mask="0x00100000" name="PRIVUSB4"/>
          <bitfield caption="Privileged Access for User Signature Block 5" mask="0x00200000" name="PRIVUSB5"/>
          <bitfield caption="Privileged Access for User Signature Block 6" mask="0x00400000" name="PRIVUSB6"/>
          <bitfield caption="Privileged Access for User Signature Block 7" mask="0x00800000" name="PRIVUSB7"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 0" mask="0x01000000" name="LOCKUSRB0"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 1" mask="0x02000000" name="LOCKUSRB1"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 2" mask="0x04000000" name="LOCKUSRB2"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 3" mask="0x08000000" name="LOCKUSRB3"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 4" mask="0x10000000" name="LOCKUSRB4"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 5" mask="0x20000000" name="LOCKUSRB5"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 6" mask="0x40000000" name="LOCKUSRB6"/>
          <bitfield caption="Lock User Signature Rights for User Signature Block 7" mask="0x80000000" name="LOCKUSRB7"/>
        </register>
        <register caption="SEFC Key Bus Lock Register" name="EEFC_KBLR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 0" mask="0x00000001" name="KBTLUSB0"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 1" mask="0x00000002" name="KBTLUSB1"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 2" mask="0x00000004" name="KBTLUSB2"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 3" mask="0x00000008" name="KBTLUSB3"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 4" mask="0x00000010" name="KBTLUSB4"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 5" mask="0x00000020" name="KBTLUSB5"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 6" mask="0x00000040" name="KBTLUSB6"/>
          <bitfield caption="Key Bus Transfer Lock from User Signature Block 7" mask="0x00000080" name="KBTLUSB7"/>
        </register>
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="GPNVM Bit Write Protection" mask="0x00000002" name="GPNVMWP"/>
          <bitfield caption="Lock Bit Write Protection" mask="0x00000004" name="LOCKWP"/>
          <bitfield caption="Erase and Write Protection" mask="0x00000008" name="ERASEWP"/>
          <bitfield caption="User Signature Write Protection" mask="0x00000010" name="USRWP"/>
          <bitfield caption="Erase and Write Lock" mask="0x00000080" name="ERASEWL"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Flash Command" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase pages (8, 16, 32, 64)" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
        <value caption="Suspend" name="SUSP" value="0x17"/>
        <value caption="Resume" name="RES" value="0x18"/>
        <value caption="Send cryptographic key" name="SCK" value="0x19"/>
      </value-group>
